Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbh.c
/**
  ******************************************************************************
  * @file    py32e407_hal_usbh.c
  * @author  MCU Application Team
  * @brief   USBHOST HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the USB Peripheral Controller:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  @verbatim
  ==============================================================================
                    ##### How to use this driver #####
  ==============================================================================
  [..]
    (#)Declare a USBHOST_HandleTypeDef handle structure, for example:
       USBHOST_HandleTypeDef  husbh;

    (#)Fill parameters of Init structure in USBHOST handle

    (#)Call HAL_USBHOST_Init() API to initialize the USBHOST peripheral (Core, Host core, ...)

    (#)Initialize the USBHOST low level resources through the HAL_USBHOST_MspInit() API:
        (##) Enable the USBHOST Low Level interface clock using the following macros
             (+++) __HAL_RCC_USB1_CLK_ENABLE();
             (+++) __HAL_RCC_USB2_CLK_ENABLE();
        (##) Initialize the related GPIO clocks
        (##) Configure USBHOST pin-out
        (##) Configure USBHOST NVIC interrupt

    (#)Associate the Upper USB Host stack to the HAL USBHOST Driver:
        (##) husbh.pData = phost;

    (#)Enable USBHOST transmission and reception:
        (##) HAL_USBHOST_Start();

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "py32e4xx_hal.h"

/** @addtogroup PY32E407_HAL_Driver
  * @{
  */

#ifdef HAL_USBH_MODULE_ENABLED

#if defined (USB1_OTG_FS) || defined (USB2_OTG_FS)

/** @defgroup USBHOST USBHOST
  * @brief USBHOST HAL module driver
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup USBHOST_Private_Functions USBHOST Private Functions
  * @{
  */
static void USBHOST_HC_IN_IRQHandler(USBHOST_HandleTypeDef *husbh, uint8_t chnum);
static void USBHOST_HC_OUT_IRQHandler(USBHOST_HandleTypeDef *husbh, uint8_t chnum);
static void USBHOST_RXQLVL_IRQHandler(USBHOST_HandleTypeDef *husbh);
static void USBHOST_Port_IRQHandler(USBHOST_HandleTypeDef *husbh);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup USBHOST_Exported_Functions USBHOST Exported Functions
  * @{
  */

/** @defgroup USBHOST_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
          ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the host driver.
  * @param  husbh USBHOST handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_Init(USBHOST_HandleTypeDef *husbh)
{
  USB_OTG_GlobalTypeDef *USBx;

  /* Check the USBHOST handle allocation */
  if (husbh == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_USBHOST_ALL_INSTANCE(husbh->Instance));

  USBx = husbh->Instance;

  if (husbh->State == HAL_USBHOST_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    husbh->Lock = HAL_UNLOCKED;

#if (USE_HAL_USBHOST_REGISTER_CALLBACKS == 1U)
    husbh->SOFCallback = HAL_USBHOST_SOF_Callback;
    husbh->ConnectCallback = HAL_USBHOST_Connect_Callback;
    husbh->DisconnectCallback = HAL_USBHOST_Disconnect_Callback;
    husbh->PortEnabledCallback = HAL_USBHOST_PortEnabled_Callback;
    husbh->PortDisabledCallback = HAL_USBHOST_PortDisabled_Callback;
    husbh->HC_NotifyURBChangeCallback = HAL_USBHOST_HC_NotifyURBChange_Callback;

    if (husbh->MspInitCallback == NULL)
    {
      husbh->MspInitCallback = HAL_USBHOST_MspInit;
    }

    /* Init the low level hardware */
    husbh->MspInitCallback(husbh);
#else
    /* Init the low level hardware : GPIO, CLOCK, NVIC... */
    HAL_USBHOST_MspInit(husbh);
#endif /* (USE_HAL_USBHOST_REGISTER_CALLBACKS) */
  }

  husbh->State = HAL_USBHOST_STATE_BUSY;

  /* Disable DMA mode for FS instance */
  if ((USBx->CID & (0x1U << 8)) == 0U)
  {
    husbh->Init.dma_enable = 0U;
  }

  /* Disable the Interrupts */
  __HAL_USBHOST_DISABLE(husbh);

  /* Init the Core (common init.) */
  (void)USB_CoreInit(husbh->Instance, husbh->Init);

  /* Force Host Mode*/
  (void)USB_SetCurrentMode(husbh->Instance, USB_HOST_MODE);

