Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbh.c
  /* Init Host */
  (void)USB_HostInit(husbh->Instance, husbh->Init);

  husbh->State = HAL_USBHOST_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  Initialize a host channel.
  * @param  husbh USBHOST handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @param  epnum Endpoint number.
  *          This parameter can be a value from 1 to 15
  * @param  dev_address Current device address
  *          This parameter can be a value from 0 to 255
  * @param  speed Current device speed.
  *          This parameter can be one of these values:
  *            USBHOST_SPEED_FULL: Full speed mode,
  *            USBHOST_SPEED_LOW: Low speed mode
  * @param  ep_type Endpoint Type.
  *          This parameter can be one of these values:
  *            EP_TYPE_CTRL: Control type,
  *            EP_TYPE_ISOC: Isochronous type,
  *            EP_TYPE_BULK: Bulk type,
  *            EP_TYPE_INTR: Interrupt type
  * @param  mps Max Packet Size.
  *          This parameter can be a value from 0 to32K
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_HC_Init(USBHOST_HandleTypeDef *husbh,
                                      uint8_t ch_num,
                                      uint8_t epnum,
                                      uint8_t dev_address,
                                      uint8_t speed,
                                      uint8_t ep_type,
                                      uint16_t mps)
{
  HAL_StatusTypeDef status;

  __HAL_LOCK(husbh);
  husbh->hc[ch_num].do_ping = 0U;
  husbh->hc[ch_num].dev_addr = dev_address;
  husbh->hc[ch_num].max_packet = mps;
  husbh->hc[ch_num].ch_num = ch_num;
  husbh->hc[ch_num].ep_type = ep_type;
  husbh->hc[ch_num].ep_num = epnum & 0x7FU;

  if ((epnum & 0x80U) == 0x80U)
  {
    husbh->hc[ch_num].ep_is_in = 1U;
  }
  else
  {
    husbh->hc[ch_num].ep_is_in = 0U;
  }

  husbh->hc[ch_num].speed = speed;

  status =  USB_HC_Init(husbh->Instance,
                        ch_num,
                        epnum,
                        dev_address,
                        speed,
                        ep_type,
                        mps);
  __HAL_UNLOCK(husbh);

  return status;
}

/**
  * @brief  Halt a host channel.
  * @param  husbh USBHOST handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_HC_Halt(USBHOST_HandleTypeDef *husbh, uint8_t ch_num)
{
  HAL_StatusTypeDef status = HAL_OK;

  __HAL_LOCK(husbh);
  (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
  __HAL_UNLOCK(husbh);

  return status;
}

/**
  * @brief  DeInitialize the host driver.
  * @param  husbh USBHOST handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_DeInit(USBHOST_HandleTypeDef *husbh)
{
  /* Check the USBHOST handle allocation */
  if (husbh == NULL)
  {
    return HAL_ERROR;
  }

  husbh->State = HAL_USBHOST_STATE_BUSY;

#if (USE_HAL_USBHOST_REGISTER_CALLBACKS == 1U)
  if (husbh->MspDeInitCallback == NULL)
  {
    husbh->MspDeInitCallback = HAL_USBHOST_MspDeInit; /* Legacy weak MspDeInit  */
  }

  /* DeInit the low level hardware */
  husbh->MspDeInitCallback(husbh);
#else
  /* DeInit the low level hardware: CLOCK, NVIC.*/
  HAL_USBHOST_MspDeInit(husbh);
#endif /* USE_HAL_USBHOST_REGISTER_CALLBACKS */

  __HAL_USBHOST_DISABLE(husbh);

  husbh->State = HAL_USBHOST_STATE_RESET;

  return HAL_OK;
}

/**
  * @brief  Initialize the USBHOST MSP.
  * @param  husbh USBHOST handle
  * @retval None
  */
__weak void  HAL_USBHOST_MspInit(USBHOST_HandleTypeDef *husbh)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbh);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBHOST_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitialize the USBHOST MSP.
  * @param  husbh USBHOST handle
  * @retval None
  */
__weak void  HAL_USBHOST_MspDeInit(USBHOST_HandleTypeDef *husbh)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbh);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBHOST_MspDeInit could be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup USBHOST_Exported_Functions_Group2 Input and Output operation functions
  *  @brief   USBHOST IO operation functions
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
 [..] This subsection provides a set of functions allowing to manage the USB Host Data
    Transfer

@endverbatim
  * @{
  */

/**
  * @brief  Submit a new URB for processing.
  * @param  husbh USBHOST handle
  * @param  ch_num Channel number.
  *         This parameter can be a value from 1 to 15
  * @param  direction Channel number.
  *          This parameter can be one of these values:
  *           0 : Output / 1 : Input
  * @param  ep_type Endpoint Type.
  *          This parameter can be one of these values:
  *            EP_TYPE_CTRL: Control type/
  *            EP_TYPE_ISOC: Isochronous type/
  *            EP_TYPE_BULK: Bulk type/
  *            EP_TYPE_INTR: Interrupt type/
  * @param  token Endpoint Type.
  *          This parameter can be one of these values:
  *            0: HC_PID_SETUP / 1: HC_PID_DATA1
  * @param  pbuff pointer to URB data
  * @param  length Length of URB data
  * @param  do_ping activate do ping protocol (for high speed only).
  *          This parameter can be one of these values:
  *           0 : do ping inactive / 1 : do ping active
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_HC_SubmitRequest(USBHOST_HandleTypeDef *husbh,
                                           uint8_t ch_num,
                                           uint8_t direction,
                                           uint8_t ep_type,
                                           uint8_t token,
                                           uint8_t *pbuff,
                                           uint16_t length,
                                           uint8_t do_ping)
{
  husbh->hc[ch_num].ep_is_in = direction;
  husbh->hc[ch_num].ep_type  = ep_type;

  if (token == 0U)
  {
    husbh->hc[ch_num].data_pid = HC_PID_SETUP;
    husbh->hc[ch_num].do_ping = do_ping;
  }
  else
  {
    husbh->hc[ch_num].data_pid = HC_PID_DATA1;
  }

  /* Manage Data Toggle */
  switch (ep_type)
  {
    case EP_TYPE_CTRL:
      if ((token == 1U) && (direction == 0U)) /*send data */
      {
        if (length == 0U)
        {
          /* For Status OUT stage, Length==0, Status Out PID = 1 */
          husbh->hc[ch_num].toggle_out = 1U;
        }

        /* Set the Data Toggle bit as per the Flag */
        if (husbh->hc[ch_num].toggle_out == 0U)
        {
          /* Put the PID 0 */
          husbh->hc[ch_num].data_pid = HC_PID_DATA0;
        }
        else
        {
          /* Put the PID 1 */
          husbh->hc[ch_num].data_pid = HC_PID_DATA1;
        }
      }
      break;

    case EP_TYPE_BULK:
      if (direction == 0U)
      {
        /* Set the Data Toggle bit as per the Flag */
        if (husbh->hc[ch_num].toggle_out == 0U)
        {
          /* Put the PID 0 */
          husbh->hc[ch_num].data_pid = HC_PID_DATA0;
        }
        else
        {
          /* Put the PID 1 */
          husbh->hc[ch_num].data_pid = HC_PID_DATA1;
        }
      }
      else
      {
        if (husbh->hc[ch_num].toggle_in == 0U)
        {
          husbh->hc[ch_num].data_pid = HC_PID_DATA0;
        }
        else
        {
          husbh->hc[ch_num].data_pid = HC_PID_DATA1;
        }
      }

      break;
    case EP_TYPE_INTR:
      if (direction == 0U)
      {
        /* Set the Data Toggle bit as per the Flag */
        if (husbh->hc[ch_num].toggle_out == 0U)
        {
          /* Put the PID 0 */
          husbh->hc[ch_num].data_pid = HC_PID_DATA0;
        }
        else
        {
          /* Put the PID 1 */
          husbh->hc[ch_num].data_pid = HC_PID_DATA1;
        }
      }
      else
      {
        if (husbh->hc[ch_num].toggle_in == 0U)
        {
          husbh->hc[ch_num].data_pid = HC_PID_DATA0;
        }
        else
        {
          husbh->hc[ch_num].data_pid = HC_PID_DATA1;
        }
      }
      break;

    case EP_TYPE_ISOC:
      husbh->hc[ch_num].data_pid = HC_PID_DATA0;
      break;

    default:
      break;
  }

  husbh->hc[ch_num].xfer_buff = pbuff;
  husbh->hc[ch_num].xfer_len  = length;
  husbh->hc[ch_num].urb_state = URB_IDLE;
  husbh->hc[ch_num].xfer_count = 0U;
  husbh->hc[ch_num].ch_num = ch_num;
  husbh->hc[ch_num].state = HC_IDLE;

