Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbh.c
  return USB_HC_StartXfer(husbh->Instance, &husbh->hc[ch_num]);
}

/**
  * @brief  Handle USBHOST interrupt request.
  * @param  husbh USBHOST handle
  * @retval None
  */
void HAL_USBHOST_IRQHandler(USBHOST_HandleTypeDef *husbh)
{
  USB_OTG_GlobalTypeDef *USBx = husbh->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t i, interrupt;

  /* Ensure that we are in host mode */
  if (USB_GetMode(husbh->Instance) == USB_OTG_MODE_HOST)
  {
    /* Avoid spurious interrupt */
    if (__HAL_USBHOST_IS_INVALID_INTERRUPT(husbh))
    {
      return;
    }

    if (__HAL_USBHOST_GET_FLAG(husbh, USB_OTG_GINTSTS_IPXFR_INCOMPISOOUT))
    {
      /* Incorrect mode, acknowledge the interrupt */
      __HAL_USBHOST_CLEAR_FLAG(husbh, USB_OTG_GINTSTS_IPXFR_INCOMPISOOUT);
    }

    if (__HAL_USBHOST_GET_FLAG(husbh, USB_OTG_GINTSTS_IISOIXFR))
    {
      /* Incorrect mode, acknowledge the interrupt */
      __HAL_USBHOST_CLEAR_FLAG(husbh, USB_OTG_GINTSTS_IISOIXFR);
    }

    if (__HAL_USBHOST_GET_FLAG(husbh, USB_OTG_GINTSTS_PTXFE))
    {
      /* Incorrect mode, acknowledge the interrupt */
      __HAL_USBHOST_CLEAR_FLAG(husbh, USB_OTG_GINTSTS_PTXFE);
    }

    if (__HAL_USBHOST_GET_FLAG(husbh, USB_OTG_GINTSTS_MMIS))
    {
      /* Incorrect mode, acknowledge the interrupt */
      __HAL_USBHOST_CLEAR_FLAG(husbh, USB_OTG_GINTSTS_MMIS);
    }

    /* Handle Host Disconnect Interrupts */
    if (__HAL_USBHOST_GET_FLAG(husbh, USB_OTG_GINTSTS_DISCINT))
    {
      __HAL_USBHOST_CLEAR_FLAG(husbh, USB_OTG_GINTSTS_DISCINT);

      if ((USBx_HPRT0 & USB_OTG_HPRT_PCSTS) == 0U)
      {
        /* Handle Host Port Disconnect Interrupt */
#if (USE_HAL_USBHOST_REGISTER_CALLBACKS == 1U)
        husbh->DisconnectCallback(husbh);
#else
        HAL_USBHOST_Disconnect_Callback(husbh);
#endif /* USE_HAL_USBHOST_REGISTER_CALLBACKS */

        (void)USB_InitFSLSPClkSel(husbh->Instance, HCFG_48_MHZ);
      }
    }

    /* Handle Host Port Interrupts */
    if (__HAL_USBHOST_GET_FLAG(husbh, USB_OTG_GINTSTS_HPRTINT))
    {
      USBHOST_Port_IRQHandler(husbh);
    }

    /* Handle Host SOF Interrupt */
    if (__HAL_USBHOST_GET_FLAG(husbh, USB_OTG_GINTSTS_SOF))
    {
#if (USE_HAL_USBHOST_REGISTER_CALLBACKS == 1U)
      husbh->SOFCallback(husbh);
#else
      HAL_USBHOST_SOF_Callback(husbh);
#endif /* USE_HAL_USBHOST_REGISTER_CALLBACKS */

      __HAL_USBHOST_CLEAR_FLAG(husbh, USB_OTG_GINTSTS_SOF);
    }

    /* Handle Host channel Interrupt */
    if (__HAL_USBHOST_GET_FLAG(husbh, USB_OTG_GINTSTS_HCINT))
    {
      interrupt = USB_HC_ReadInterrupt(husbh->Instance);
      for (i = 0U; i < husbh->Init.Host_channels; i++)
      {
        if ((interrupt & (1UL << (i & 0xFU))) != 0U)
        {
          if ((USBx_HC(i)->HCCHAR & USB_OTG_HCCHAR_EPDIR) == USB_OTG_HCCHAR_EPDIR)
          {
            USBHOST_HC_IN_IRQHandler(husbh, (uint8_t)i);
          }
          else
          {
            USBHOST_HC_OUT_IRQHandler(husbh, (uint8_t)i);
          }
        }
      }
      __HAL_USBHOST_CLEAR_FLAG(husbh, USB_OTG_GINTSTS_HCINT);
    }

    /* Handle Rx Queue Level Interrupts */
    if ((__HAL_USBHOST_GET_FLAG(husbh, USB_OTG_GINTSTS_RXFLVL)) != 0U)
    {
      USB_MASK_INTERRUPT(husbh->Instance, USB_OTG_GINTSTS_RXFLVL);

      USBHOST_RXQLVL_IRQHandler(husbh);

      USB_UNMASK_INTERRUPT(husbh->Instance, USB_OTG_GINTSTS_RXFLVL);
    }
  }
}

/**
  * @brief  SOF callback.
  * @param  husbh USBHOST handle
  * @retval None
  */
__weak void HAL_USBHOST_SOF_Callback(USBHOST_HandleTypeDef *husbh)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbh);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBHOST_SOF_Callback could be implemented in the user file
   */
}

/**
  * @brief Connection Event callback.
  * @param  husbh USBHOST handle
  * @retval None
  */
__weak void HAL_USBHOST_Connect_Callback(USBHOST_HandleTypeDef *husbh)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbh);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBHOST_Connect_Callback could be implemented in the user file
   */
}

/**
  * @brief  Disconnection Event callback.
  * @param  husbh USBHOST handle
  * @retval None
  */
__weak void HAL_USBHOST_Disconnect_Callback(USBHOST_HandleTypeDef *husbh)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbh);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBHOST_Disconnect_Callback could be implemented in the user file
   */
}

/**
  * @brief  Port Enabled  Event callback.
  * @param  husbh USBHOST handle
  * @retval None
  */
__weak void HAL_USBHOST_PortEnabled_Callback(USBHOST_HandleTypeDef *husbh)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbh);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBHOST_Disconnect_Callback could be implemented in the user file
   */
}

/**
  * @brief  Port Disabled  Event callback.
  * @param  husbh USBHOST handle
  * @retval None
  */
__weak void HAL_USBHOST_PortDisabled_Callback(USBHOST_HandleTypeDef *husbh)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbh);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBHOST_Disconnect_Callback could be implemented in the user file
   */
}

/**
  * @brief  Notify URB state change callback.
  * @param  husbh USBHOST handle
  * @param  chnum Channel number.
  *         This parameter can be a value from 1 to 15
  * @param  urb_state:
  *          This parameter can be one of these values:
  *            URB_IDLE/
  *            URB_DONE/
  *            URB_NOTREADY/
  *            URB_NYET/
  *            URB_ERROR/
  *            URB_STALL/
  * @retval None
  */
__weak void HAL_USBHOST_HC_NotifyURBChange_Callback(USBHOST_HandleTypeDef *husbh, uint8_t chnum, USBHOST_URBStateTypeDef urb_state)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(husbh);
  UNUSED(chnum);
  UNUSED(urb_state);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_USBHOST_HC_NotifyURBChange_Callback could be implemented in the user file
   */
}

#if (USE_HAL_USBHOST_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User USB USBHOST Callback
  *         To be used instead of the weak predefined callback
  * @param  husbh USB USBHOST handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_USBHOST_SOF_CB_ID USB USBHOST SOF callback ID
  *          @arg @ref HAL_USBHOST_CONNECT_CB_ID USB USBHOST Connect callback ID
  *          @arg @ref HAL_USBHOST_DISCONNECT_CB_ID OTG USBHOST Disconnect callback ID
  *          @arg @ref HAL_USBHOST_PORT_ENABLED_CB_ID USB USBHOST Port Enable callback ID
  *          @arg @ref HAL_USBHOST_PORT_DISABLED_CB_ID USB USBHOST Port Disable callback ID
  *          @arg @ref HAL_USBHOST_MSPINIT_CB_ID MspDeInit callback ID
  *          @arg @ref HAL_USBHOST_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_RegisterCallback(USBHOST_HandleTypeDef *husbh, HAL_USBHOST_CallbackIDTypeDef CallbackID, pUSBHOST_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    husbh->ErrorCode |= HAL_USBHOST_ERROR_INVALID_CALLBACK;
    return HAL_ERROR;
  }
  /* Process locked */
  __HAL_LOCK(husbh);

  if (husbh->State == HAL_USBHOST_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_USBHOST_SOF_CB_ID :
        husbh->SOFCallback = pCallback;
        break;

