Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbh.c
      case HAL_USBHOST_CONNECT_CB_ID :
        husbh->ConnectCallback = pCallback;
        break;

      case HAL_USBHOST_DISCONNECT_CB_ID :
        husbh->DisconnectCallback = pCallback;
        break;

      case HAL_USBHOST_PORT_ENABLED_CB_ID :
        husbh->PortEnabledCallback = pCallback;
        break;

      case HAL_USBHOST_PORT_DISABLED_CB_ID :
        husbh->PortDisabledCallback = pCallback;
        break;

      case HAL_USBHOST_MSPINIT_CB_ID :
        husbh->MspInitCallback = pCallback;
        break;

      case HAL_USBHOST_MSPDEINIT_CB_ID :
        husbh->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        husbh->ErrorCode |= HAL_USBHOST_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (husbh->State == HAL_USBHOST_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_USBHOST_MSPINIT_CB_ID :
        husbh->MspInitCallback = pCallback;
        break;

      case HAL_USBHOST_MSPDEINIT_CB_ID :
        husbh->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        husbh->ErrorCode |= HAL_USBHOST_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    husbh->ErrorCode |= HAL_USBHOST_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbh);
  return status;
}

/**
  * @brief  Unregister an USB USBHOST Callback
  *         USB USBHOST callabck is redirected to the weak predefined callback
  * @param  husbh USB USBHOST handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_USBHOST_SOF_CB_ID USB USBHOST SOF callback ID
  *          @arg @ref HAL_USBHOST_CONNECT_CB_ID USB USBHOST Connect callback ID
  *          @arg @ref HAL_USBHOST_DISCONNECT_CB_ID OTG USBHOST Disconnect callback ID
  *          @arg @ref HAL_USBHOST_PORT_ENABLED_CB_ID USB USBHOST Port Enabled callback ID
  *          @arg @ref HAL_USBHOST_PORT_DISABLED_CB_ID USB USBHOST Port Disabled callback ID
  *          @arg @ref HAL_USBHOST_MSPINIT_CB_ID MspDeInit callback ID
  *          @arg @ref HAL_USBHOST_MSPDEINIT_CB_ID MspDeInit callback ID
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_UnRegisterCallback(USBHOST_HandleTypeDef *husbh, HAL_USBHOST_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(husbh);

  /* Setup Legacy weak Callbacks  */
  if (husbh->State == HAL_USBHOST_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_USBHOST_SOF_CB_ID :
        husbh->SOFCallback = HAL_USBHOST_SOF_Callback;
        break;

      case HAL_USBHOST_CONNECT_CB_ID :
        husbh->ConnectCallback = HAL_USBHOST_Connect_Callback;
        break;

      case HAL_USBHOST_DISCONNECT_CB_ID :
        husbh->DisconnectCallback = HAL_USBHOST_Disconnect_Callback;
        break;

      case HAL_USBHOST_PORT_ENABLED_CB_ID :
        husbh->PortEnabledCallback = HAL_USBHOST_PortEnabled_Callback;
        break;

      case HAL_USBHOST_PORT_DISABLED_CB_ID :
        husbh->PortDisabledCallback = HAL_USBHOST_PortDisabled_Callback;
        break;

      case HAL_USBHOST_MSPINIT_CB_ID :
        husbh->MspInitCallback = HAL_USBHOST_MspInit;
        break;

      case HAL_USBHOST_MSPDEINIT_CB_ID :
        husbh->MspDeInitCallback = HAL_USBHOST_MspDeInit;
        break;

      default :
        /* Update the error code */
        husbh->ErrorCode |= HAL_USBHOST_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (husbh->State == HAL_USBHOST_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_USBHOST_MSPINIT_CB_ID :
        husbh->MspInitCallback = HAL_USBHOST_MspInit;
        break;

      case HAL_USBHOST_MSPDEINIT_CB_ID :
        husbh->MspDeInitCallback = HAL_USBHOST_MspDeInit;
        break;

      default :
        /* Update the error code */
        husbh->ErrorCode |= HAL_USBHOST_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    husbh->ErrorCode |= HAL_USBHOST_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbh);
  return status;
}

/**
  * @brief  Register USB USBHOST Host Channel Notify URB Change Callback
  *         To be used instead of the weak HAL_USBHOST_HC_NotifyURBChange_Callback() predefined callback
  * @param  husbh USBHOST handle
  * @param  pCallback pointer to the USB USBHOST Host Channel Notify URB Change Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_RegisterHC_NotifyURBChangeCallback(USBHOST_HandleTypeDef *husbh, pUSBHOST_HC_NotifyURBChangeCallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    husbh->ErrorCode |= HAL_USBHOST_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  /* Process locked */
  __HAL_LOCK(husbh);

  if (husbh->State == HAL_USBHOST_STATE_READY)
  {
    husbh->HC_NotifyURBChangeCallback = pCallback;
  }
  else
  {
    /* Update the error code */
    husbh->ErrorCode |= HAL_USBHOST_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbh);

  return status;
}

/**
  * @brief  UnRegister the USB USBHOST Host Channel Notify URB Change Callback
  *         USB USBHOST Host Channel Notify URB Change Callback is redirected to the weak HAL_USBHOST_HC_NotifyURBChange_Callback() predefined callback
  * @param  husbh USBHOST handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_UnRegisterHC_NotifyURBChangeCallback(USBHOST_HandleTypeDef *husbh)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(husbh);

  if (husbh->State == HAL_USBHOST_STATE_READY)
  {
    husbh->HC_NotifyURBChangeCallback = HAL_USBHOST_HC_NotifyURBChange_Callback; /* Legacy weak DataOutStageCallback  */
  }
  else
  {
    /* Update the error code */
    husbh->ErrorCode |= HAL_USBHOST_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(husbh);

