Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbh.c
  return status;
}
#endif /* USE_HAL_USBHOST_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup USBHOST_Exported_Functions_Group3 Peripheral Control functions
 *  @brief   Management functions
 *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the USBHOST data
    transfers.

@endverbatim
  * @{
  */

/**
  * @brief  Start the host driver.
  * @param  husbh USBHOST handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_Start(USBHOST_HandleTypeDef *husbh)
{
  __HAL_LOCK(husbh);
  __HAL_USBHOST_ENABLE(husbh);
  (void)USB_DriveVbus(husbh->Instance, 1U);
  __HAL_UNLOCK(husbh);

  return HAL_OK;
}

/**
  * @brief  Stop the host driver.
  * @param  husbh USBHOST handle
  * @retval HAL status
  */

HAL_StatusTypeDef HAL_USBHOST_Stop(USBHOST_HandleTypeDef *husbh)
{
  __HAL_LOCK(husbh);
  (void)USB_StopHost(husbh->Instance);
  __HAL_UNLOCK(husbh);

  return HAL_OK;
}

/**
  * @brief  Reset the host port.
  * @param  husbh USBHOST handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_USBHOST_ResetPort(USBHOST_HandleTypeDef *husbh)
{
  return (USB_ResetPort(husbh->Instance));
}

/**
  * @}
  */

/** @defgroup USBHOST_Exported_Functions_Group4 Peripheral State functions
 *  @brief   Peripheral State functions
 *
@verbatim
 ===============================================================================
                      ##### Peripheral State functions #####
 ===============================================================================
    [..]
    This subsection permits to get in run-time the status of the peripheral
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  Return the USBHOST handle state.
  * @param  husbh USBHOST handle
  * @retval HAL state
  */
USBHOST_StateTypeDef HAL_USBHOST_GetState(USBHOST_HandleTypeDef *husbh)
{
  return husbh->State;
}

/**
  * @brief  Return  URB state for a channel.
  * @param  husbh USBHOST handle
  * @param  chnum Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval URB state.
  *          This parameter can be one of these values:
  *            URB_IDLE/
  *            URB_DONE/
  *            URB_NOTREADY/
  *            URB_NYET/
  *            URB_ERROR/
  *            URB_STALL
  */
USBHOST_URBStateTypeDef HAL_USBHOST_HC_GetURBState(USBHOST_HandleTypeDef *husbh, uint8_t chnum)
{
  return husbh->hc[chnum].urb_state;
}


/**
  * @brief  Return the last host transfer size.
  * @param  husbh USBHOST handle
  * @param  chnum Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval last transfer size in byte
  */
uint32_t HAL_USBHOST_HC_GetXferCount(USBHOST_HandleTypeDef *husbh, uint8_t chnum)
{
  return husbh->hc[chnum].xfer_count;
}

/**
  * @brief  Return the Host Channel state.
  * @param  husbh USBHOST handle
  * @param  chnum Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval Host channel state
  *          This parameter can be one of these values:
  *            HC_IDLE/
  *            HC_XFRC/
  *            HC_HALTED/
  *            HC_NYET/
  *            HC_NAK/
  *            HC_STALL/
  *            HC_XACTERR/
  *            HC_BBLERR/
  *            HC_DATATGLERR
  */
USBHOST_HCStateTypeDef  HAL_USBHOST_HC_GetState(USBHOST_HandleTypeDef *husbh, uint8_t chnum)
{
  return husbh->hc[chnum].state;
}

/**
  * @brief  Return the current Host frame number.
  * @param  husbh USBHOST handle
  * @retval Current Host frame number
  */
uint32_t HAL_USBHOST_GetCurrentFrame(USBHOST_HandleTypeDef *husbh)
{
  return (USB_GetCurrentFrame(husbh->Instance));
}

/**
  * @brief  Return the Host enumeration speed.
  * @param  husbh USBHOST handle
  * @retval Enumeration speed
  */
uint32_t HAL_USBHOST_GetCurrentSpeed(USBHOST_HandleTypeDef *husbh)
{
  return (USB_GetHostSpeed(husbh->Instance));
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup USBHOST_Private_Functions
  * @{
  */
/**
  * @brief  Handle Host Channel IN interrupt requests.
  * @param  husbh USBHOST handle
  * @param  chnum Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval none
  */
static void USBHOST_HC_IN_IRQHandler(USBHOST_HandleTypeDef *husbh, uint8_t chnum)
{
  USB_OTG_GlobalTypeDef *USBx = husbh->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t ch_num = (uint32_t)chnum;

  uint32_t tmpreg;

  if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_ACK) == USB_OTG_HCINT_ACK)
  {
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_ACK);
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_BBERR) == USB_OTG_HCINT_BBERR)
  {
    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    husbh->hc[ch_num].state = HC_BBLERR;
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_NAK);
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_BBERR);
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_STALL) == USB_OTG_HCINT_STALL)
  {
    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    husbh->hc[ch_num].state = HC_STALL;
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_NAK);
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_STALL);
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_DTERR) == USB_OTG_HCINT_DTERR)
  {
    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_NAK);
    husbh->hc[ch_num].state = HC_DATATGLERR;
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_DTERR);
  }
  else
  {
    /* ... */
  }

  if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_FRMOR) == USB_OTG_HCINT_FRMOR)
  {
    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_FRMOR);
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_XFRC) == USB_OTG_HCINT_XFRC)
  {
    husbh->hc[ch_num].state = HC_XFRC;
    husbh->hc[ch_num].ErrCnt = 0U;
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_XFRC);

    if ((husbh->hc[ch_num].ep_type == EP_TYPE_CTRL) ||
        (husbh->hc[ch_num].ep_type == EP_TYPE_BULK))
    {
      __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
      (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
      __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_NAK);
    }
    else if (husbh->hc[ch_num].ep_type == EP_TYPE_INTR)
    {
      USBx_HC(ch_num)->HCCHAR |= USB_OTG_HCCHAR_ODDFRM;
      husbh->hc[ch_num].urb_state = URB_DONE;

#if (USE_HAL_USBHOST_REGISTER_CALLBACKS == 1U)
      husbh->HC_NotifyURBChangeCallback(husbh, (uint8_t)ch_num, husbh->hc[ch_num].urb_state);
#else
      HAL_USBHOST_HC_NotifyURBChange_Callback(husbh, (uint8_t)ch_num, husbh->hc[ch_num].urb_state);
#endif /* USE_HAL_USBHOST_REGISTER_CALLBACKS */
    }
    else if (husbh->hc[ch_num].ep_type == EP_TYPE_ISOC)
    {
      husbh->hc[ch_num].urb_state = URB_DONE;

#if (USE_HAL_USBHOST_REGISTER_CALLBACKS == 1U)
      husbh->HC_NotifyURBChangeCallback(husbh, (uint8_t)ch_num, husbh->hc[ch_num].urb_state);
#else
      HAL_USBHOST_HC_NotifyURBChange_Callback(husbh, (uint8_t)ch_num, husbh->hc[ch_num].urb_state);
#endif /* USE_HAL_USBHOST_REGISTER_CALLBACKS */
    }
    else
    {
      /* ... */
    }
    husbh->hc[ch_num].toggle_in ^= 1U;

