Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbh.c
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_CHH) == USB_OTG_HCINT_CHH)
  {
    __HAL_USBHOST_MASK_HALT_HC_INT(ch_num);

    if (husbh->hc[ch_num].state == HC_XFRC)
    {
      husbh->hc[ch_num].urb_state  = URB_DONE;
    }
    else if (husbh->hc[ch_num].state == HC_STALL)
    {
      husbh->hc[ch_num].urb_state  = URB_STALL;
    }
    else if ((husbh->hc[ch_num].state == HC_XACTERR) ||
             (husbh->hc[ch_num].state == HC_DATATGLERR))
    {
      husbh->hc[ch_num].ErrCnt++;
      if (husbh->hc[ch_num].ErrCnt > 3U)
      {
        husbh->hc[ch_num].ErrCnt = 0U;
        husbh->hc[ch_num].urb_state = URB_ERROR;
      }
      else
      {
        husbh->hc[ch_num].urb_state = URB_NOTREADY;
      }

      /* re-activate the channel  */
      tmpreg = USBx_HC(ch_num)->HCCHAR;
      tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
      tmpreg |= USB_OTG_HCCHAR_CHENA;
      USBx_HC(ch_num)->HCCHAR = tmpreg;
    }
    else if (husbh->hc[ch_num].state == HC_NAK)
    {
      husbh->hc[ch_num].urb_state  = URB_NOTREADY;
      /* re-activate the channel  */
      tmpreg = USBx_HC(ch_num)->HCCHAR;
      tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
      tmpreg |= USB_OTG_HCCHAR_CHENA;
      USBx_HC(ch_num)->HCCHAR = tmpreg;
    }
    else
    {
      /* ... */
    }
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_CHH);
    HAL_USBHOST_HC_NotifyURBChange_Callback(husbh, (uint8_t)ch_num, husbh->hc[ch_num].urb_state);
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_TXERR) == USB_OTG_HCINT_TXERR)
  {
    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    husbh->hc[ch_num].ErrCnt++;
    husbh->hc[ch_num].state = HC_XACTERR;
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_TXERR);
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_NAK) == USB_OTG_HCINT_NAK)
  {
    if (husbh->hc[ch_num].ep_type == EP_TYPE_INTR)
    {
      husbh->hc[ch_num].ErrCnt = 0U;
      __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
      (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    }
    else if ((husbh->hc[ch_num].ep_type == EP_TYPE_CTRL) ||
             (husbh->hc[ch_num].ep_type == EP_TYPE_BULK))
    {
      husbh->hc[ch_num].ErrCnt = 0U;
      husbh->hc[ch_num].state = HC_NAK;
      __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
      (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    }
    else
    {
      /* ... */
    }
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_NAK);
  }
  else
  {
    /* ... */
  }
}

/**
  * @brief  Handle Host Channel OUT interrupt requests.
  * @param  husbh USBHOST handle
  * @param  chnum Channel number.
  *         This parameter can be a value from 1 to 15
  * @retval none
  */
static void USBHOST_HC_OUT_IRQHandler(USBHOST_HandleTypeDef *husbh, uint8_t chnum)
{
  USB_OTG_GlobalTypeDef *USBx = husbh->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t ch_num = (uint32_t)chnum;
  uint32_t tmpreg;

  if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_ACK) == USB_OTG_HCINT_ACK)
  {
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_ACK);

    if (husbh->hc[ch_num].do_ping == 1U)
    {
      husbh->hc[ch_num].do_ping = 0U;
      husbh->hc[ch_num].urb_state  = URB_NOTREADY;
      __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
      (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    }
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_FRMOR) == USB_OTG_HCINT_FRMOR)
  {
    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_FRMOR);
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_XFRC) == USB_OTG_HCINT_XFRC)
  {
    husbh->hc[ch_num].ErrCnt = 0U;
    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_XFRC);
    husbh->hc[ch_num].state = HC_XFRC;
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_STALL) == USB_OTG_HCINT_STALL)
  {
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_STALL);
    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    husbh->hc[ch_num].state = HC_STALL;
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_NAK) == USB_OTG_HCINT_NAK)
  {
    husbh->hc[ch_num].ErrCnt = 0U;
    husbh->hc[ch_num].state = HC_NAK;

    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_NAK);
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_TXERR) == USB_OTG_HCINT_TXERR)
  {
    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    husbh->hc[ch_num].state = HC_XACTERR;
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_TXERR);
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_DTERR) == USB_OTG_HCINT_DTERR)
  {
    __HAL_USBHOST_UNMASK_HALT_HC_INT(ch_num);
    (void)USB_HC_Halt(husbh->Instance, (uint8_t)ch_num);
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_NAK);
    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_DTERR);
    husbh->hc[ch_num].state = HC_DATATGLERR;
  }
  else if ((USBx_HC(ch_num)->HCINT & USB_OTG_HCINT_CHH) == USB_OTG_HCINT_CHH)
  {
    __HAL_USBHOST_MASK_HALT_HC_INT(ch_num);

    if (husbh->hc[ch_num].state == HC_XFRC)
    {
      husbh->hc[ch_num].urb_state  = URB_DONE;
      if ((husbh->hc[ch_num].ep_type == EP_TYPE_BULK) ||
          (husbh->hc[ch_num].ep_type == EP_TYPE_INTR))
      {
        husbh->hc[ch_num].toggle_out ^= 1U;
      }
    }
    else if (husbh->hc[ch_num].state == HC_NAK)
    {
      husbh->hc[ch_num].urb_state = URB_NOTREADY;
    }
    else if (husbh->hc[ch_num].state == HC_NYET)
    {
      husbh->hc[ch_num].urb_state  = URB_NOTREADY;
    }
    else if (husbh->hc[ch_num].state == HC_STALL)
    {
      husbh->hc[ch_num].urb_state  = URB_STALL;
    }
    else if ((husbh->hc[ch_num].state == HC_XACTERR) ||
             (husbh->hc[ch_num].state == HC_DATATGLERR))
    {
      husbh->hc[ch_num].ErrCnt++;
      if (husbh->hc[ch_num].ErrCnt > 3U)
      {
        husbh->hc[ch_num].ErrCnt = 0U;
        husbh->hc[ch_num].urb_state = URB_ERROR;
      }
      else
      {
        husbh->hc[ch_num].urb_state = URB_NOTREADY;
      }

      /* re-activate the channel  */
      tmpreg = USBx_HC(ch_num)->HCCHAR;
      tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
      tmpreg |= USB_OTG_HCCHAR_CHENA;
      USBx_HC(ch_num)->HCCHAR = tmpreg;
    }
    else
    {
      /* ... */
    }

    __HAL_USBHOST_CLEAR_HC_INT(ch_num, USB_OTG_HCINT_CHH);
    HAL_USBHOST_HC_NotifyURBChange_Callback(husbh, (uint8_t)ch_num, husbh->hc[ch_num].urb_state);
  }
  else
  {
    /* ... */
  }
}

/**
  * @brief  Handle Rx Queue Level interrupt requests.
  * @param  husbh USBHOST handle
  * @retval none
  */
static void USBHOST_RXQLVL_IRQHandler(USBHOST_HandleTypeDef *husbh)
{
  USB_OTG_GlobalTypeDef *USBx = husbh->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t pktsts;
  uint32_t pktcnt;
  uint32_t temp;
  uint32_t tmpreg;
  uint32_t ch_num;

  temp = husbh->Instance->GRXSTSP;
  ch_num = temp & USB_OTG_GRXSTSP_EPNUM;
  pktsts = (temp & USB_OTG_GRXSTSP_PKTSTS) >> 17;
  pktcnt = (temp & USB_OTG_GRXSTSP_BCNT) >> 4;

  switch (pktsts)
  {
    case GRXSTS_PKTSTS_IN:
      /* Read the data into the host buffer. */
      if ((pktcnt > 0U) && (husbh->hc[ch_num].xfer_buff != (void *)0))
      {
        (void)USB_ReadPacket(husbh->Instance, husbh->hc[ch_num].xfer_buff, (uint16_t)pktcnt);

