Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_usbh.c
        /*manage multiple Xfer */
        husbh->hc[ch_num].xfer_buff += pktcnt;
        husbh->hc[ch_num].xfer_count  += pktcnt;

        if ((USBx_HC(ch_num)->HCTSIZ & USB_OTG_HCTSIZ_PKTCNT) > 0U)
        {
          /* re-activate the channel when more packets are expected */
          tmpreg = USBx_HC(ch_num)->HCCHAR;
          tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
          tmpreg |= USB_OTG_HCCHAR_CHENA;
          USBx_HC(ch_num)->HCCHAR = tmpreg;
          husbh->hc[ch_num].toggle_in ^= 1U;
        }
      }
      break;

    case GRXSTS_PKTSTS_DATA_TOGGLE_ERR:
      break;

    case GRXSTS_PKTSTS_IN_XFER_COMP:
    case GRXSTS_PKTSTS_CH_HALTED:
    default:
      break;
  }
}

/**
  * @brief  Handle Host Port interrupt requests.
  * @param  husbh USBHOST handle
  * @retval None
  */
static void USBHOST_Port_IRQHandler(USBHOST_HandleTypeDef *husbh)
{
  USB_OTG_GlobalTypeDef *USBx = husbh->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  __IO uint32_t hprt0, hprt0_dup;

  /* Handle Host Port Interrupts */
  hprt0 = USBx_HPRT0;
  hprt0_dup = USBx_HPRT0;

  hprt0_dup &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET | \
                 USB_OTG_HPRT_PENCHNG);

  /* Check whether Port Connect detected */
  if ((hprt0 & USB_OTG_HPRT_PCDET) == USB_OTG_HPRT_PCDET)
  {
    if ((hprt0 & USB_OTG_HPRT_PCSTS) == USB_OTG_HPRT_PCSTS)
    {
#if (USE_HAL_USBHOST_REGISTER_CALLBACKS == 1U)
      husbh->ConnectCallback(husbh);
#else
      HAL_USBHOST_Connect_Callback(husbh);
#endif /* USE_HAL_USBHOST_REGISTER_CALLBACKS */
    }
    hprt0_dup  |= USB_OTG_HPRT_PCDET;
  }

  /* Check whether Port Enable Changed */
  if ((hprt0 & USB_OTG_HPRT_PENCHNG) == USB_OTG_HPRT_PENCHNG)
  {
    hprt0_dup |= USB_OTG_HPRT_PENCHNG;

    if ((hprt0 & USB_OTG_HPRT_PENA) == USB_OTG_HPRT_PENA)
    {
      if ((hprt0 & USB_OTG_HPRT_PSPD) == (HPRT0_PRTSPD_LOW_SPEED << 17))
      {
        (void)USB_InitFSLSPClkSel(husbh->Instance, HCFG_6_MHZ);
      }
      else
      {
        (void)USB_InitFSLSPClkSel(husbh->Instance, HCFG_48_MHZ);
      }
      
#if (USE_HAL_USBHOST_REGISTER_CALLBACKS == 1U)
      husbh->PortEnabledCallback(husbh);
#else
      HAL_USBHOST_PortEnabled_Callback(husbh);
#endif /* USE_HAL_USBHOST_REGISTER_CALLBACKS */

    }
    else
    {
#if (USE_HAL_USBHOST_REGISTER_CALLBACKS == 1U)
      husbh->PortDisabledCallback(husbh);
#else
      HAL_USBHOST_PortDisabled_Callback(husbh);
#endif /* USE_HAL_USBHOST_REGISTER_CALLBACKS */
    }
  }

  /* Clear Port Interrupts */
  USBx_HPRT0 = hprt0_dup;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (USB1_OTG_FS) || defined (USB2_OTG_FS) */
#endif /* HAL_USBH_MODULE_ENABLED */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
